## DF to MS SQL

In [1]:
# uncomment these and run this if not loaded...
# !pip3 install pandas
# !pip install pymssql

In [2]:
ls

 Volume in drive C is Windows
 Volume Serial Number is C28A-6242

 Directory of C:\Users\W0304403\GitHub\Class-Share

2024-11-21  01:05 PM    <DIR>          .
2024-11-21  01:05 PM    <DIR>          ..
2024-09-21  11:58 AM                66 .gitattributes
2024-11-20  11:47 AM    <DIR>          .ipynb_checkpoints
2024-09-22  09:47 AM               625 CalendarYear_M_starter.txt
2024-10-17  11:09 AM             8,615 CTE.ipynb
2024-11-19  11:11 AM    <DIR>          data
2024-09-27  12:32 PM               267 NW_Emp_Ages.sql
2024-09-23  04:22 PM               103 README.md
2024-11-01  09:55 AM             1,150 SQLCodeTest.ipynb
2024-11-21  01:05 PM            14,766 Titanic_Import.ipynb
2024-11-01  09:47 AM            23,765 TwentyFiveTips.ipynb
2024-10-21  08:44 AM             5,898 Vehicles_Switch_True.ipynb
               9 File(s)         55,255 bytes
               4 Dir(s)  897,101,369,344 bytes free

In [3]:
import pandas as pd
df = pd.read_csv('./data/TitanicFinal_1.csv')
df.describe(include='object').T

            count unique          top freq
LastName     1317    894         Sage   11
FirstName    1317   1142      Mr John   13
Title        1317     20           Mr  765
Gender       1317      2            M  851
txt.Gender   1317      2         Male  851
txt.Boarded  1317      4  Southampton  912
txt.Class    1317      3          3rd  709
txt.Survive  1317      2           No  833

In [4]:
df.columns

Index(['ID', 'LastName', 'FirstName', 'Title', 'f.Gender', 'Gender',
       'txt.Gender', 'f.Boarded', 'txt.Boarded', 'f.Class', 'txt.Class',
       'int.Yrs', 'f.Survived', 'txt.Survive'],
      dtype='object')

In [5]:
df.head(3)

,ID,LastName,FirstName,Title,f.Gender,Gender,txt.Gender,f.Boarded,txt.Boarded,f.Class,txt.Class,int.Yrs,f.Survived,txt.Survive
0,1,Ab i-Al-Munà,Mr Nas if Qasim,Mr,0,M,Male,2,Cherbourg,3,3rd,26,1,Yes
1,2,Abbing,Mr Anthony,Mr,0,M,Male,1,Southampton,3,3rd,42,0,No
2,3,Abbott,Mrs Rhoda Mary “Rosa”,Mrs,1,F,Female,1,Southampton,3,3rd,39,1,Yes

In [6]:
df = df[['ID', 'LastName', 'FirstName', 'Title', 'Gender',  'txt.Boarded', 'txt.Class', 'int.Yrs', 'txt.Survive']]  # like select
df.columns = ['ID', 'LastName', 'FirstName', 'Title', 'Gender',  'Boarded', 'Class', 'Yrs', 'Survive'] # like as

In [7]:
df.head(1)

,ID,LastName,FirstName,Title,Gender,Boarded,Class,Yrs,Survive
0,1,Ab i-Al-Munà,Mr Nas if Qasim,Mr,M,Cherbourg,3rd,26,Yes

### Create table in SSMS 

```
USE Sandbox;
GO

DROP TABLE if EXISTS stg.Titanic;
GO

CREATE TABLE stg.Titanic(
    ID INT,
    LastName NVARCHAR(50),
    FirstName NVARCHAR(100),
    Title NVARCHAR(10),
    Gender NVARCHAR(2),
    Boarded NVARCHAR(50),
    Class NVARCHAR(5),
    Yrs	INT,
    Survive NVARCHAR(5)
)
```

In [8]:
import pymssql

# Establish the connection
conn = pymssql.connect(server = 'localhost', user = 'sa', password = '1234', database = 'Sandbox')  
cursor = conn.cursor()

# Insert Dataframe into SQL Server:
for index, row in df.iterrows():
    insert_q = f"INSERT INTO stg.Titanic(ID, LastName, FirstName, Title, Gender, Boarded, Class, Yrs, Survive) values(%s,%s,%s,%s,%s,%s,%s,%s,%s)"
    cursor.execute(insert_q, (row['ID'], row['LastName'], row['FirstName'], row['Title'], row['Gender'], row['Boarded'], row['Class'], row['Yrs'], row['Survive'] ))
    
conn.commit()
cursor.close()
conn.close()

print("DataFrame written to SQL Server successfully!")

DataFrame written to SQL Server successfully!